const China = {
  上海市: "上海",
  云南省: "云南",
  内蒙古自治区: "内蒙古",
  北京市: "北京",
  台湾省: "台湾",
  吉林省: "吉林",
  四川省: "四川",
  天津市: "天津",
  宁夏回族自治区: "宁夏",
  安徽省: "安徽",
  山东省: "山东",
  山西省: "山西",
  广东省: "广东",
  广西壮族自治区: "广西",
  新疆维吾尔自治区: "新疆",
  江苏省: "江苏",
  江西省: "江西",
  河北省: "河北",
  河南省: "河南",
  浙江省: "浙江",
  海南省: "海南",
  湖北省: "湖北",
  湖南省: "湖南",
  澳门特别行政区: "澳门",
  甘肃省: "甘肃",
  福建省: "福建",
  西藏自治区: "西藏",
  贵州省: "贵州",
  辽宁省: "辽宁",
  重庆市: "重庆",
  陕西省: "陕西",
  青海省: "青海",
  香港特别行政区: "香港",
  黑龙江省: "黑龙江",
};

const colorConfig = [
  "#ffffff",
  "#fff2cf",
  "#ff8c71",
  "#e64b45",
  "#bd1316",
  "#211103",
];
const colorMap = {
  "#ffffff": "0",
  "#fff2cf": "1-9 ",
  "#ff8c71": "10-99 ",
  "#e64b45": "100-999 ",
  "#bd1316": "1000-10000 ",
  "#211103": ">10000 ",
};
const centerMap = {
  北京: {
    scale: 7000,
    center: [116, 40],
  },

  天津: {
    scale: 7000,
    center: [117, 39],
  },

  河北: {
    scale: 2500,
    center: [116, 39],
  },

  山西: {
    scale: 2500,
    center: [112, 37],
  },
  内蒙古: {
    scale: 1000,
    center: [114, 46],
  },
  辽宁: {
    scale: 3000,
    center: [122, 41],
  },
  吉林: {
    scale: 2500,
    center: [126, 44],
  },

  黑龙江: { scale: 1500, center: [128, 49] },
  上海: { scale: 14000, center: [121.3, 31.2] },
  江苏: { scale: 4000, center: [119, 33] },
  浙江: { scale: 4000, center: [120, 29] },
  安徽: { scale: 4000, center: [117, 32] },
  福建: { scale: 4000, center: [118, 26] },
  江西: { scale: 3500, center: [115, 27.5] },
  山东: { scale: 4000, center: [118.5, 36.5] },
  河南: {
    scale: 3500,
    center: [113.5, 34],
  },

  湖北: {
    scale: 4000,
    center: [112, 31],
  },
  湖南: {
    scale: 3500,
    center: [111, 27.5],
  },
  广东: { scale: 3500, center: [113, 23] },
  广西: {
    scale: 3500,
    center: [108, 23.5],
  },
  海南: {
    scale: 9000,
    center: [110, 19.2],
  },
  重庆: { scale: 5000, center: [108, 30.2] },
  四川: {
    scale: 2500,
    center: [103, 30.2],
  },
  贵州: {
    scale: 4000,
    center: [106.5, 27],
  },
  云南: { scale: 2500, center: [101, 25] },
  西藏: {
    scale: 1700,
    center: [88, 31],
  },
  陕西: { scale: 2500, center: [108, 35.6] },
  甘肃: { scale: 1800, center: [100, 37.7] },
  青海: { scale: 2200, center: [96, 35.5] },
  宁夏: { scale: 4500, center: [106, 37.3] },
  新疆: { scale: 1200, center: [85, 42] },
  台湾: { scale: 6000, center: [120, 23.5] },
  香港: {
    scale: 47000,
    center: [114.1, 22.35],
  },
  澳门: { scale: 177000, center: [113.55, 22.16] },
};
const colorConfig_Province = [
  "#fff2cf",
  "#ff8c71",
  "#e64b45",
  "#bd1316",
  "#7f1100",
  "#000000",
];
const confirm = [
  "#FFEBEB",
  "#FFD6D8",
  "#FF8589",
  "#ff474e",
  "#e90009",
  "#660003",
];
const active = [
  "#ebf4ff",
  "#add3ff",
  "#70b3ff",
  "#1F87FF",

  "#0056B8",
  "#001D3D",
];
const recovered = [
  "#f4fdef",
  "#cdf3c4",
  "#5ad060",
  "#1fb644",
  "#00982f",
  "#00801f",
];
const dead = ["#F8F9FA", "#CED4DA", "#6C757D", "#2E3338", "#1B1F22", "#000000"];
const colorMap_Province = {
  "#fff2cf": "0 ",
  "#ff8c71": "1-9 ",
  "#e64b45": "10-99 ",
  "#bd1316": "100-999 ",
  "#7f1100": "1000-9999 ",
  "#000000": ">=10000 ",
};
const colorMapNew = {
  "#FFEBEB": "0 ",
  "#FFD6D8": "1-9 ",
  "#FF8589": "10-99 ",
  "#ff474e": "100-999 ",
  "#e90009": "1000-9999 ",
  "#660003": ">=10000 ",
  "#ebf4ff": "0 ",
  "#add3ff": "1-9 ",
  "#70b3ff": "10-99 ",
  "#1F87FF": "100-999 ",
  "#0056B8": "1000-9999 ",
  "#001D3D": ">=10000 ",
  "#f4fdef": "0 ",
  "#cdf3c4": "1-9 ",
  "#5ad060": "10-99 ",
  "#1fb644": "100-999 ",
  "#00982f": "1000-9999 ",
  "#00801f": ">=10000 ",
  "#F8F9FA": "0 ",
  "#CED4DA": "1-9 ",
  "#6C757D": "10-99 ",
  "#2E3338": "100-999 ",
  "#1B1F22": "1000-9999 ",
  "#000000": ">=10000 ",
};
export {
  China,
  colorConfig,
  colorMap,
  centerMap,
  colorConfig_Province,
  colorMap_Province,
  colorMapNew,
  confirm,
  recovered,
  dead,
  active,
};
